export const state = () => ({
  all: [
    {
      id: 1,
      image: '',
      slug: 'introduction-devops',
      title: 'مقدمه ای بر DevOps و Continuous Delivery',
      content: 'در این وبینار قصد داریم به این موضوع کلیدی در تولید نرم افزار بپردازیم که چرا علیرغم تمام تلاشها، وعده ها و حتی در مواردی با حضور معماران فراوان معمولا در نهایت به جای یک پارک آبی زیبا، یک باتلاق ترسناک ساخته میشود. بحث میکنیم که DevOps چیست و چگونه به ما کمک میکند شرکتی به بزرگی آمازون را با پویایی زیاد اداره کنیم. همچنین چرا Continuous Delivery مهم است و فرآیند آن به چه صورت است. یکی از جالبترین یافته های شرکت آمازون این است که راحتی فرآیند ‌‌انتشار و راه اندازی یک نرم افزار در محیط عملیاتی رابطه ای مستقیم و قوی با رضایت کاری یک تیم نرم افزاری و باقی ماندن نیروها در شرکت برای طولانی مدت دارد. نکته ای که باید برای مدیران تیمهای نرم افزاری بسیار حایز اهمیت باشد.',
      provider: 'امیر مقیمی'
    }
  ]
});
