export const state = () => ([
  {
    id: 1,
    provider: 'امیر مقیمی',
    slug: 'introduction-devops',
    title: 'مقدمه ای بر DevOps',
    image: '/img/static-site-generation.png',
    content: 'در این وبینار قصد داریم به این موضوع کلیدی در تولید نرم افزار بپردازیم که چرا علیرغم تمام تلاشها، وعده ها و حتی در مواردی با حضور معماران فراوان معمولا در نهایت به جای یک پارک آبی زیبا، یک باتلاق ترسناک ساخته میشود. بحث میکنیم که DevOps چیست و چگونه به ما کمک میکند شرکتی به بزرگی آمازون را با پویایی زیاد اداره کنیم.'
  },
  {
    id: 2,
    provider: 'امیر رضا قادری',
    slug: 'introduction-golang',
    title: 'وبینار آشنایی با زبان Go',
    image: '/img/async-data-with-nuxtjs.png',
    content: 'در این وبینار قصد داریم نگاهی داشته باشیم به زبان برنامه‌نویسی Go. از آنجایی که تعریف و تمجدید از تکنولوژی های تازه و هیجان برانگیز کار آسانی است، در این ارائه سعی خواهیم داشت که موضوع را با رویکردی منتقدانه بررسی کنیم تا سوای از امکانات جالب و مفید این زبان، با نقاط ضعف و کمبودهای آن نیز آشنا شویم!'
  },
  {
    id: 3,
    provider: 'امیر رضا قادری',
    slug: 'what-is-the-cqrs',
    title: 'مروری بر CQRS',
    image: '/img/nuxt-fundamentals.png',
    content: 'در این وبینار قصد داریم علت نیاز به الگوی CQRS در پروژه های مبتنی بر DDD را بررسی کنیم، خواستگاه CQRS را از دیدگاه پدید آورنده ی آن (Grek Young) معرفی کرده و ملزومات استفاده از Event Sourcing به عنوان مکانیزم ذخیره سازی را بیان کنیم.'
  }
]);
