<template>
  <div class="content">
    <p>
      برای هر یک از موارد زیر خوشحال خواهیم شد که با ما تماس بگیرید
    </p>
    <ul>
      <li>سوال در مورد وبینار های قبلی</li>
      <li>تمایل برای ارائه یک وبینار</li>
      <li>تمایل به همکاری با تیم اجرایی</li>
    </ul>
    <p>از آنجایی که تاک هنوز در مراحل اولیه حیات خود به سر می برد  از هر گونه کمک اجرایی و فکری دوستان استقبال می کند.</p>
    <p>برای تماس با ما می توانید از ایمیل admin@taakestan.com استفاده کنید</p>
    <p>همچنین می توانید با عضویت در گروه اینترنتی در تبادل نظرات شرکت کنید</p>
    <p> همچنین با مراجع به صفحه ما در فیسبوک می توانید با ما در ارتباط باشید</p>
  </div>
</template>

<script>
	export default {
		name: "contact-us"
	}
</script>

<style lang="scss" scoped>
  .container {
    margin-top: 1rem;
  }
</style>
